#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "f0559efa6a51a8a40606572dc718af03" -> "2fb5692c809412b761f5e359d50a6dd3"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "6e915c3cb8f31180637aeae94b203927" -> "e1466f7c9043814835f5c6a2ff26dd26"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "1504766a4724c50f5a147193a10fc485" -> "d37e34a86ab93b6fb17f89fed7a1d698"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "34d27725f97595d48f49d517fde0dddd" -> "c2d1285d164734af506dfb72d1bc46c0"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "774ec8e11d11290e7184d91d7c2221d5" -> "adaf851655f06bc99f2999b08379d40f"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "ef3bd2432a5658fd42f6d490783cd76c" -> "3e6f149c48d16117c5a52e87c8ed7122"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "31647e90494def4f0eebe4c9bc4a03fb" -> "96efd41fb4ed12a0933727de14b6653e"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "05e7e58796f5cc2263c1d336b0f558cc" -> "a484ca2065a2b2069f4f40e48e6940e8"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "af70969da24bf1d3314b42ae18198c27" -> "138e1f8621375bd0dc72262375985235"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "d5154c428edb1072d0749e23320aecbf" -> "304773291c83ad8b8040f4d063749162"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "03e91392b3eef21cf162b5531a58aa4f" -> "ac47edbb2a957b02838c0974c52bb782"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "c6bc16fd7d8e00f1d3212b220b4e4d4f" -> "e7dfe6b3c6bfb150a1a5bb1fd6baa239"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "21b4759ebcd40fb0c25efe61fe459021" -> "7bff12ebd970ba5e9c12059c6e94420a"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "10ff8757898a18f59b78d088c9641647" -> "577dfed98799b59d1cb7d207f199e350"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "8a6a17c25141f11049377600dee045a8" -> "f73b2fbca20cddf7dc1bda85b9594d13"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "ea37c50696070361600a1fea0c86f61a" -> "0955f0272d639a2a88e618a9c130d2d5"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "452d303f75009f01c078c80b773e3c23" -> "d5894b95418f000c0f71012fddbd4382"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "f6e695d6b7912e6658e3038e4b9bee1b" -> "0dc385d8a0def14e0e3473977d986c98"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "e5593260c29f527c45d35dbc8d054a38" -> "be654d0b6b2c2741478c96ae0df2e48f"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "90973b0c0da4a2c2fde9c2357649e6af" -> "3ac6871b7e9687d40455b77a57951e61"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "1de5ed9895e66196efcbe8b646988e43" -> "2d7310a705231bde2d6775896f3f52f6"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "fa358467ecff8dc1e6e47be7eebdcf45" -> "48d9dc7b785d18ed8eff1075613fc485"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "3d6ff17de5bc7e64a3da7aa7814a1e6f" -> "5b335f5c3caf2633fbd6e2f9ea275e0f"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "e778ea282ba8e73ce5db474a4d9b7a35" -> "5de5f9778611c0368d29c9424c3e7e30"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "28fb04e7c062ed1e8b9a2f7523d2827c" -> "f77159fb7ff69cd7c5e6bae51ece06bc"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "21ad334c5c63a911df18b776fc4141c6" -> "f0ab52f671bc3f18e12fcf8824db15ed"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "72ba62c3416930e6ffa7afbec577bf17" -> "afe34106f44e50df6ed1699fac984730"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "7e93b7706b1ebb01e925c4ac12827235" -> "59d03a75628e601fc86528c74e0729f2"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "e5d7ba81b227f1a39e2bf1cabddd92d1" -> "dc5a6d210553b36bc117cd52b5e6d17a"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "8b71c38794a200a752cdb402f7bd9471" -> "fd53bcb4dbc8abb5c0d71f5e8c4c130b"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "051f842d51d4017f2167bbc154d7c4ff" -> "d70b3e52fe62470141ef5a2ec8cd3301"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "5437f07161794e50e53f43cc217ce2a8" -> "107d18825692914925dc2b52a2831bdf"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "ce0339d48e79cb9dd05474f19623df7b" -> "c2a22abb655edb643344a764b080bb64"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "28b174f289db40ae0503f7bc523ab134" -> "0e698a08f9d2854716aab8b0e6d0cb02"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "04544ec3b9f8c7520edebecee2f54e13" -> "c4af491bc8816401b7870d10818af31a"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "cc0f70cd7cc0dec810c95c9bfe6c0887" -> "e6fa94eae170177fee667dcb887642e2"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "68e2d854f470009068a02c6173f4fa27" -> "c0cf5c330177eac48fde5593fdb9b17d"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "1b0ee5209c7c0b75b18a2f3d7b0f4a3e" -> "9c2621b0c3557495b99d825fb218b8fb"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "b0b56160f3c31198d580eb88ed3b4f20" -> "daeb1f4393c8600de5589e1e6dcbd308"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "322995cf0a52159781f9fb9c4bbb5fde" -> "9593ae1bd8a53b7c8358c9fddb85149a"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "962941e548997e9d1833d260ac00c889" -> "d75d768ddd8249c9a75981f73ce706e6"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "e66c50af927b5843030e0c6b33748b38" -> "f924db5931b7ea58d74108124aa31dc7"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "24b4914f46adceccfedde5c04da1f474" -> "a3ee34f3e6149a48b9579be62357db0f"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "5bf26d560ff54184947ab2c29c50fc13" -> "01ff2a3c6d95665845f1b94a064619b4"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "f4ac1ed08a01e0fa9b9ef88430215948" -> "364b996430e8137faa03c5e55f4484d1"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "c86a567a85147e4e4a81415b6091b084" -> "b949c13cb6ac81b33fe3520356aad8ca"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "f6b3da27208bfefce89fa638e207b3d5" -> "3faee81a4fd64a55f7321643f665a462"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "O794mZtvHMpuaTiNFmTEeovQqbSjDt0zHpBQp0m28VQ=" -> "+5rJeLrMU/QzI37T1fqcEsltYVM4T6Cfu+h8w2fOYRo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "M5wGYDdEtoimr4bx1w81ONW1sBOagpiwM2iXAyrsH4c=" -> "JoHYb+zsCtwEqZ7hYRHtpzYauduyXX1VfXoR7c47LBo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "bHqtEhhTPCWCe3pOZWYK1ziUHVfqUbLS7fasdqwtSOM=" -> "wxvPECihf2yiT/D8MxMjHcYcmVijO0S1NxTPeltezwo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "XbJbo/ACTbwlbH0zp10+QyQiUexA1aet9vieG75L+5U=" -> "2agcqvRlXko62mCcA3cz3Ky9CGFXSKG2Hysqxm9Ck38="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "dHZ2vmnVnBETPmQY094maEhX6ZNjosZjuKylS2gMT70=" -> "58JXbsJIB01SQWW8cmo8leiyHkbJmOV09jwAHEg/UFw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mq1Mnspg9xZI12GjluVyx7icVWlK57RfYd3vLQadQQY=" -> "6RT/roYDTL6GT9UNocXm2G7KEGsLTzgs8oelXKLEbm8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "cklJMzbeXFvBby0Ek+9BOXvqDkE75C12RR2c1mC0UtQ=" -> "mW5g0qy1f3FFlyOEOH8dEOJVR4X8HII7MJJvFxV1uQU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "qdiMspE5kRHNFkxVlSv+kiFKm9LAwPnEXwM0r6WLva0=" -> "ALzlHLL+JPEULaoW/CgvmrMs26Fp8CaqMEH6TGuMxM8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "G6LDNZWxHoZ6dRfTzQ9V/TjZnT55jMkhciwI5G4ZF8E=" -> "ptDtUBj1JU0fdsQ/kVYXtarAUAcJhy0tb4+V0ph1coY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "udv2O+ohwoEHmbHCQVAjLTNjVdRZlzPpRiClGMv65qI=" -> "czCKVNTkK1CFgPIcsTp7KGQz4j3d4tqlhtTc1iiceKU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "1xJ70ykAV6N8f410Qcjtb3it3KtNbG5mS7qD0GoE53w=" -> "inOrm0mwbf6VN+zQXZl6LwymwA+T7pd3tUqEYnZs/R8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "ELru+XL1TaEDrG3FN4tPhviQ8OdMEP6CqDlFFE2QNRk=" -> "HHTu4W1gM7ZWbWMSbn5kaL2UDeKsGTS9bpDSb8p6aeU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "uHTFF8627Il46b1dAMixlf9pk1XVAkEomH6FTnefIu4=" -> "8FP2fg2CdzIl5tQJ7RsAf0oNnqdACkNsVLaGqQnXtwQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "SwWiNC0xMCXtyfL9qQBOw6W5qdEo9OHF6oRptuQsICg=" -> "sqEtxudPXI1ciFtvcYJF44nTWwIykI3qNMEfUiFGDaI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "2Sik4P3r6qH4GArUW2gOswDOY6lOnMY+0EZufEWq7QE=" -> "G70H77z8ka+XgMfWuzkesyEmQLotjgNRx33TYTeqN+o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "tTOr/ZHTmtBsfgekmLTKmDJxvE3Ed/tIFNEWDAEYE+Y=" -> "Rki/ih/y0SVv6bMl49oBxkIx+z5zO3eNoMvcYxUW8To="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cb7fkYIMmhrFLCnhqPCOXKnpYp3dy/TeDN0SbUNs4Do=" -> "R1XPryx0KqVJnOf/5iZXCSbc+eFtFdPyDz0h/OT0jVg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "V2GiAnKUaPK9ewDvJo1NTUjf5g/S17/twoimADMhIzY=" -> "X5XNP1SGnpM7DpUMHG+VTpQPrj/17RUoi6UfkhlYHso="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "S5yCbS+MvfdXqvlX4Ed8Nfg5cLnGObT7JI1fAHVbAW0=" -> "pc1UT0MME8fVC+fOvMyJFJ3quQQZ6LZrQhTIhoRnIzA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "YJYDIr9ZqDwhStzM61+dAmZGqKpSO8jUNUAyQ1tUMVc=" -> "iQlq5c9y+dlITJiEQ3WzFbMOrDFSlE1Ull+sKppDA4Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "fPXNIoJIjNYeeP8NvwNNNWyuc9fPFw1R22TWLUmiwKc=" -> "2vvU/LNMCIKT+gaogZL14c/hoGsga6nnvhkSKWk3pEc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "c+Geome2K/JV+byuIWptYnzZoosG0wv84seuXS9PEzA=" -> "DhmNZBP/S+GE29u8VMIsbNtwvI8w7XusA6X0aIAnSMU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "R/awEjjcz2sgkq9ASBINHzD+AHpSO11raf2HfqIKXvk=" -> "/PucqMPpd2J7QESxdLLvvHmUzn22PQBXdV2DC60FqAY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "w2oYHzUcB7sLerPfS3gpk+Zk2BfC+jGPzViYFdiRBVI=" -> "lnlJ5v50kDQ+boM0NrdSIv/vAB5GPYusZnuHAl7eUvU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "kb4TdFIvy2RhH+1aWt8/1QU0l4NyKOyX+opL1KxbMPY=" -> "Ihvg5Q/jvPWlbEflaUshGoUtpKi2DelcxHFGCzEr4To="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "E1b7KAu9Pioe5OJlMHV8co+pvdyQevHY2EUJVCdqKcQ=" -> "EX/T3vkkamK9mkjJOW5qNh+nbn/ilNUo8ZotcJgLNsE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "49nVKJtSxP7y6/f8qz8AArDuxveGGvCDX8RmszHaTAY=" -> "hoWf47b1Lo0uNcTIFOI5nDsT9lJnTxtxhYEGJpR/6LQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "k6BzOD1nmlNBQgsaLLtMHDcPPhYKeS+h3VtaMaG4n/s=" -> "MnrAhvQnz6RFdj2WLeIgfyAQvbZcTn6ri3/x74ZFDbw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "g6vlqcSJqpTnnwNd8ELL+kNV1LROvqKxDoAsX2Ft4vc=" -> "lNPXbF1CZvYuiL6Jrqtlh2mZz1QFnuupAGyh5KRV8Ro="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "7zVmIPzFuoMTwR8i8n7TItxIcjLJngggV+/avJjgWmw=" -> "47bm6SGs35/DFtuYqFmgPajgWo9RJ6H2nu+zgHc209Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-03-02T00:07:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "JMJg4umsEJfmVTXxixVKr4fc5NNd/f8zsTmZs5tF3uc=" -> "61EwBe7gV8wecvlEfjTIS5PwFSswCQlYEMTvmS6i470="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "KYo6hBrwKP2zCXHnbhMa4/W9B8JHW1C/aZm5xxxM3xk=" -> "z7k9zZ9JAHS9gjEoAt3N5tpAT1ArBZuwnkJ5UNrNd6U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "h1nR9vs4APPfLSOVyx4CkFs+gb8GMr15WShCQm5SE50=" -> "1UQBns6c9CLOsrE+gWUrspjN4zw+8tZK5/KWf9G1hRk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "s4C7r/7au5KIF6TMrvVhu39PoGoeM6jcZS0zu59CK+Y=" -> "3kFZZhtDwBb7zmFh/QjS8EsN5VRd7pg0C9XIThvzNxQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "VgKkUvumMc8nqPrp9/EBUFnbYek3SM1cStAJ5IK5bg0=" -> "FdniWYFhI2U+FBP2oAU/XXRiczmFZwwcbhApILa6NOo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "1MthM7a3p9/O9xW3zMreG8Ow3GZv4aI7UJAxmCmdVrg=" -> "iuJ0OxYMn3xTJCaPwFElIg8Miq5jLlOFmlmbv3aNVfc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "MXdMGZFey+R8kzZ97zDTC91NxdEqcPZNnnUV4bTGNY0=" -> "mfyLX4y1WXXwpCTqiXUOOFRzLk9K6GUfeJoi/DQssgk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "dPY9C6e7WzdYQddZpHj6fEHbeIXfWxO6wIS1XBUZ9r0=" -> "1RGsJm0DgFG9+2N4Q28wXoW81GmzIM5wn6f5DrsKR60="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y5+fbZymDeZlk30pHtKZx3FmU6MMBz1YO8zv10fIioc=" -> "Jr2VQjEagF6Bj2o4GpuBflck0Hsb0dYfRaBuHfcIelY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "imAdBOh3YKR2MwrQlhKVRbv2rK/88Iporzg7sEJ1Nas=" -> "FKaOfr7iC3zR3FgMNC+/LgNd3blQJqVPw3OnfEdWP7M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "vBBG2fPdRxqha6dkEKl4FWR26V1Mcf9Hjzo8GL2yp6U=" -> "+IvPHK+xO5698oH6z/KA/lUG+xgGAetYCutoWlynrEA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "0CzwuKTPRmrAxghjJYvFUpZCsjmMb4wiljyjVtIoLec=" -> "Knx+SxNZ+kD+4EDTMi8kacB/DdEeuizh1yp3kUnBfMk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "dL+2nb2nMPwbyQJ3qkhF1QyyyrTzz8WqZgkq/55D7ZY=" -> "lletLI3ElSx1mYnVuovAMQbKKQZ4Ps0u542E4k55kfk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-03-01T17:58:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "o9OVSokPVSmun3EXfK1cGTMye+QMQSJ2C7DlkM7Gfo4=" -> "FQfmiQRttQptfDzXDzcgmzrd2SkTgZevBLy13QmfXTY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "j4YKchg8weruS2JORS7Zya7EKTnEzgfaDXHORvJcsMM=" -> "sBUWvXUjcjEqGH+rhklquxYvAZtazG1vAbIAVTf0RLo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-03-01T17:59:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "W7SiuFoDQEyeiWwa9Dzd8G9zwdBKfYYvMeYNRWcLZiw=" -> "DqvXg6hWHCPhTICyZvPdicvRy2EFgwwaMFA8xFejSgc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-03-01T17:58:51Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "80kglq" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-03-01T17:58:50Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-03-01T17:58:48Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*